app/views/groups/mygroup.html.erb

              <!-- activity blocks go here -->
              <% @user.groups.each do |group| %>
---
SELECT "groups".* FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 1]]