app/views/groups/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."group_id" = ?  [["group_id", 1]]
---
              <!-- activity blocks go here -->
              <% @group.posts.each do |post| %>