app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
        <!-- activity blocks go here -->
        <% @user.posts.each do |post| %>

SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
            <h3 class="panel-title"> <b> <%= post.title %> </b> <span class ="small-muted"> <i> posted in
              <%= link_to "#{post.group.name}", group_path(post.group) %> @ <%= post.created_at %> </i></span></h3>