app/views/home/index.html.erb

              <div class="row">
                <div class="col-xs-4 col-xs-offset-2"><span class="larger-text"><%= current_user.groups.count %></span> groups </div>
                <div class="col-xs-4"><span class="larger-text"><%= current_user.posts.count %></span> posts</div>
---
SELECT "groups".* FROM "groups"
SELECT COUNT(*) FROM "groups" INNER JOIN "groups_users" ON "groups"."id" = "groups_users"."group_id" WHERE "groups_users"."user_id" = ?  [["user_id", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]

                  <i> posted in
                    <%= link_to "#{post.group.name}", group_path(post.group) %>
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

                <div class="col-xs-6">
                  <b><%= post.user.first_name%> <%= post.user.last_name%></b> <span class="text-muted">@<%= post.user.username%> &#183; <%= time_ago_in_words(post.created_at) %> </span><br>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]