app/controllers/groups_controller.rb

	def index
		@groups = Group.all.order('created_at ASC')
---
SELECT "groups".* FROM "groups" WHERE (name LIKE '%Ruby%') ORDER BY created_at ASC

	def show
		@groups = Group.all
		@group = Group.find(params[:id])
---
SELECT "groups".* FROM "groups"
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def mygroup
		@user = User.find (params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]

	def create
		@group = Group.new(group_params)

		respond_to do |format|
			if @group.save
---
INSERT INTO "groups" ("name", "description", "location", "owner", "background_image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

	def update
		respond_to do |format|
			if @group.update(group_params)
---
UPDATE "groups" SET "location" = ?, "updated_at" = ? WHERE "groups"."id" = ?  [["location", "worstland, tn"], ["updated_at", 2017-04-12 11:49:03 UTC], ["id", 6]]

	def join_group
		@group = Group.find(params[:id])
---
SELECT  "groups".* FROM "groups" WHERE "groups"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]