app/controllers/home_controller.rb

	  def index
	  	@user =  User.find(current_user)
	  	@groups = Group.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "groups".* FROM "groups"