app/controllers/users_controller.rb

UPDATE "users" SET "first_name" = ?, "last_name" = ?, "street" = ?, "city" = ?, "state" = ?, "zip_code" = ?, "about_me" = ?, "background_image" = ?, "updated_at" = ? WHERE "users"."id" = ?
---
def update
  respond_to do |format|
    if @user.update(user_params)